# IFC_DeleteObjectMap

## Description
Deletes mapping for object.

```pascal
FUNCTION IFC_DeleteObjectMap(objectName : STRING) : BOOLEAN;
```

```python

def vs.IFC_DeleteObjectMap(objectName):
    return BOOLEAN
```

## Parameters
|Name|Type|Description|
|---|---|---|
|objectName|STRING||

## Version
Availability: from Vectorworks 2023.4
## Category
* IFC